OdStepFile.checkRepo(OdDAI.Repository!System.Runtime.CompilerServices.IsConst*)
\details
Checks if repository can be attached to OdStepFile schema-dependent implementation.
\param repo [in] A raw pointer to the repository object to be attached to the file object.
\returns true if repository can be attached to OdStepFile implementation; otherwise returns false.

OdStepFile.checkSchema(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks if schema with identifier provided is supported by OdStepFile schema-dependent implementation.
\param schemaIdentifier [in] A string that contains the schema identifier.
\returns true if schema is supported by OdStepFile implementation; otherwise returns false.

OdStepFile.onReadFileEnd
\details
Method is called just after file reading has ended.
\returns eOk if operation successfully done; otherwise, the method returns an appropriate error code.
\remarks Default implementation just returns eOk.

OdStepFile.recalcRootIds
\details
Recalculate the model's root instances.
\returns eOk if operation is successful; otherwise, the method returns an appropriate error code.

OdStepFile.getRootIds
\details
Retrieves the model's root instances.
\returns The identifiers of the root instances of the model.

OdStepFile.gsNode
\details
Retrieves the current Gs node object of the entity.
\returns Returns a raw pointer to the OdGsCache object associated with the entity.

OdStepFile.setGsNode(OdGsCache*)
\details
Sets a new Gs node cache for the drawable.
\param pGsNode [in] A raw pointer to an OdGsCache object.

OdStepFile.detach
\details
Closes the model attached to the file object and detaches the repository object associated with the model.
After detaching, it is possible to work with the repository and the model at a low level.
\returns A smart pointer to the unattached repository instance.

OdStepFile.writeFile(OdSmartPtr&lt;OdStreamBuf&gt;,System.Boolean)
\details
Writes data from the specified stream buffer to a physical file.
\param pStream      [in] A smart pointer to the output stream buffer object to write data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.

OdStepFile.writeFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Writes data from the file object to a physical file.
\param fileName     [in] A string that contains the full path to the output file to write data.
\param saveLogFile  [in] A flag that determines whether the log file should be also written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.

OdStepFile.readFile(OdSmartPtr&lt;OdStreamBuf&gt;)
\details
Reads data from a specified stream.
\param pStream [in] A smart pointer to the data buffer associated with the input stream.
\returns eOk if the data was successfully read; otherwise, the method returns an appropriate error code.

OdStepFile.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Reads model data from a specified file of one of supported physical formats (Step Physical File/HDF5/XML or zipped).
\param fileName [in] A string that contains the full path to the input file to read data from.
\returns eOk if the data was successfully read; otherwise, the method returns an appropriate error code.

OdStepFile.initialize(OdDAI.Repository*)
\details
Initializes OdStepFile instance with a specified repository. After the initialization, the model becomes opened in read-only
access mode by default and stays in this mode while the repository is attached to the file object.
\param repo [in] A raw pointer to the repository object to be attached to the file object.
\returns eOk if the repository object was successfully attached; otherwise, the method returns an appropriate error code.

OdStepFile.getShortFileName
\details
Retrieves the current name (file name) of a physical file associated with the repository object without path to the file.
\returns A string that contains the file name without path to it.

OdStepFile.setFileName(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assigns a name (file name) to the OdStepFile container.
\param name [in] File name.

OdStepFile.getFileName
\details
Retrieves the current name (file name) of a physical file associated with the repository object.
\returns A string that contains the file name.

OdStepFile.Dispose
\details
Destroys the OdStepFile file object.

OdStepFile
\details
A class that implements working with an Step Physical File header and data sections (header and model).